IsValidType Method
Overload List
Name | Description
IsValidType(ElementId)
 Checks if given type is valid for this element.
IsValidType(Document, ICollectionElementId, ElementId)
 Checks if given type is valid for the set of elements.
See Also
Element Class
Element Members
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →